{
  "nodes": [
    {
      "op": "null",
      "name": "hgfpn_stage1_add_alpha",
      "attrs": {
        "__init__": "[\"myconstant\", {\"value\": [[1]]}]",
        "__lr_mult__": "1",
        "__shape__": "(1, 1)"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "data",
      "inputs": []
    },
    {
      "op": "null",
      "name": "bn_data_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "True",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "bn_data_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "True",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "bn_data_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "True",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "bn_data_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "True",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "bn_data",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "True",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 1], [5, 0, 1]]
    },
    {
      "op": "null",
      "name": "conv0_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(7, 7)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(3, 3)",
        "stride": "(2, 2)"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "conv0",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(7, 7)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(3, 3)",
        "stride": "(2, 2)"
      },
      "inputs": [[6, 0, 0], [7, 0, 0]]
    },
    {
      "op": "null",
      "name": "bn0_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "bn0_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "bn0_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "bn0_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "bn0",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.99",
        "use_global_stats": "True"
      },
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "relu0",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[13, 0, 0]]
    },
    {
      "op": "Pooling",
      "name": "pooling0",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "pad": "(1, 1)",
        "pool_type": "max",
        "stride": "(2, 2)"
      },
      "inputs": [[14, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn1_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn1_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn1_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn1_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit1_bn1",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit1_relu1",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[20, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit1_conv1_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit1_conv1",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[21, 0, 0], [22, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn2_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn2_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn2_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn2_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit1_bn2",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit1_relu2",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[28, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit1_conv2_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit1_conv2",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[29, 0, 0], [30, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn3_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn3_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn3_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit1_bn3_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit1_bn3",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit1_relu3",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[36, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit1_conv3_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "256",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit1_conv3",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "256",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[37, 0, 0], [38, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit1_sc_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "256",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit1_sc",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "256",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[21, 0, 0], [40, 0, 0]]
    },
    {
      "op": "elemwise_add",
      "name": "_plus0",
      "attrs": {"__lr_mult__": "0.25"},
      "inputs": [[39, 0, 0], [41, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn1_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn1_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn1_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn1_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit2_bn1",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit2_relu1",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[47, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit2_conv1_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit2_conv1",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[48, 0, 0], [49, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn2_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn2_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn2_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn2_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit2_bn2",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit2_relu2",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[55, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit2_conv2_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit2_conv2",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[56, 0, 0], [57, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn3_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn3_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn3_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit2_bn3_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit2_bn3",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit2_relu3",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[63, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit2_conv3_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "256",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit2_conv3",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "256",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[64, 0, 0], [65, 0, 0]]
    },
    {
      "op": "elemwise_add",
      "name": "_plus1",
      "attrs": {"__lr_mult__": "0.25"},
      "inputs": [[66, 0, 0], [42, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn1_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn1_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn1_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn1_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit3_bn1",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 1], [71, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit3_relu1",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[72, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit3_conv1_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit3_conv1",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[73, 0, 0], [74, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn2_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn2_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn2_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn2_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit3_bn2",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 1], [79, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit3_relu2",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[80, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit3_conv2_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit3_conv2",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "64",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[81, 0, 0], [82, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn3_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn3_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn3_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage1_unit3_bn3_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage1_unit3_bn3",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0], [86, 0, 1], [87, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage1_unit3_relu3",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[88, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage1_unit3_conv3_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "256",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage1_unit3_conv3",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "256",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[89, 0, 0], [90, 0, 0]]
    },
    {
      "op": "elemwise_add",
      "name": "_plus2",
      "attrs": {"__lr_mult__": "0.25"},
      "inputs": [[91, 0, 0], [67, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn1_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn1_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn1_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn1_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit1_bn1",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 1], [96, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit1_relu1",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[97, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit1_conv1_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit1_conv1",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[98, 0, 0], [99, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn2_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn2_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn2_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn2_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit1_bn2",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 1], [104, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit1_relu2",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[105, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit1_conv2_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(1, 1)",
        "stride": "(2, 2)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit1_conv2",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(1, 1)",
        "stride": "(2, 2)",
        "workspace": "512"
      },
      "inputs": [[106, 0, 0], [107, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn3_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn3_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn3_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit1_bn3_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit1_bn3",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[108, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 1], [112, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit1_relu3",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[113, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit1_conv3_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "512",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit1_conv3",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "512",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[114, 0, 0], [115, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit1_sc_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "512",
        "stride": "(2, 2)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit1_sc",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "512",
        "stride": "(2, 2)",
        "workspace": "512"
      },
      "inputs": [[98, 0, 0], [117, 0, 0]]
    },
    {
      "op": "elemwise_add",
      "name": "_plus3",
      "attrs": {"__lr_mult__": "0.25"},
      "inputs": [[116, 0, 0], [118, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn1_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn1_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn1_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn1_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit2_bn1",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 1], [123, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit2_relu1",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[124, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit2_conv1_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit2_conv1",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[125, 0, 0], [126, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn2_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn2_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn2_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn2_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit2_bn2",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 1], [131, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit2_relu2",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[132, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit2_conv2_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit2_conv2",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[133, 0, 0], [134, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn3_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn3_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn3_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit2_bn3_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit2_bn3",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit2_relu3",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[140, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit2_conv3_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "512",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit2_conv3",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "512",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[141, 0, 0], [142, 0, 0]]
    },
    {
      "op": "elemwise_add",
      "name": "_plus4",
      "attrs": {"__lr_mult__": "0.25"},
      "inputs": [[143, 0, 0], [119, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn1_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn1_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn1_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn1_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit3_bn1",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 1], [148, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit3_relu1",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[149, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit3_conv1_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit3_conv1",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[150, 0, 0], [151, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn2_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn2_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn2_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn2_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit3_bn2",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[152, 0, 0], [153, 0, 0], [154, 0, 0], [155, 0, 1], [156, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit3_relu2",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[157, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit3_conv2_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit3_conv2",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(3, 3)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[158, 0, 0], [159, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn3_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn3_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn3_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit3_bn3_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit3_bn3",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[160, 0, 0], [161, 0, 0], [162, 0, 0], [163, 0, 1], [164, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit3_relu3",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[165, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit3_conv3_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "512",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit3_conv3",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "512",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": [[166, 0, 0], [167, 0, 0]]
    },
    {
      "op": "elemwise_add",
      "name": "_plus5",
      "attrs": {"__lr_mult__": "0.25"},
      "inputs": [[168, 0, 0], [144, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit4_bn1_gamma",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit4_bn1_beta",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit4_bn1_moving_mean",
      "attrs": {
        "__init__": "[\"zero\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "stage2_unit4_bn1_moving_var",
      "attrs": {
        "__init__": "[\"one\", {}]",
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": []
    },
    {
      "op": "BatchNorm",
      "name": "stage2_unit4_bn1",
      "attrs": {
        "__lr_mult__": "0.25",
        "eps": "2e-05",
        "fix_gamma": "False",
        "momentum": "0.9",
        "use_global_stats": "True"
      },
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 1], [173, 0, 1]]
    },
    {
      "op": "Activation",
      "name": "stage2_unit4_relu1",
      "attrs": {
        "__lr_mult__": "0.25",
        "act_type": "relu"
      },
      "inputs": [[174, 0, 0]]
    },
    {
      "op": "null",
      "name": "stage2_unit4_conv1_weight",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
        "num_filter": "128",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "stage2_unit4_conv1",
      "attrs": {
        "__lr_mult__": "0.25",
        "kernel": "(1, 1)",
        "no_bias": "True",
